app/controllers/welcome_controller.rb

  def index
    if params[:search].blank?
      if @results.empty?
        @results = ["ome","doe","trese"]
      else
        @results = Company.all
      end
    else
      @parameter = params[:search]
      @results = Company.where(companyName: @parameter).or(Company.where(companySymbol: @parameter))
---
SELECT  "companies".* FROM "companies" ORDER BY "companies"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "companies".* FROM "companies" WHERE ("companies"."companyName" = $1 OR "companies"."companySymbol" = $2)  [["companyName", "TSLA"], ["companySymbol", "TSLA"]]