app/controllers/welcome_controller.rb

SELECT  "companies".* FROM "companies" LIMIT $1  [["LIMIT", 11]]
---
  def index
    if !(Company.first.nil?)